package io.ahnndroid.algorithmstudy.bfs._01_미로탈출로봇;

/**
 * 
[ 문제 설명 ]
미로탈출 로봇 대회를 개최하였다. 
대회에 사용되는 미로는 가로(WIDTH), 세로(HEIGHT) 100이하의 크기이며, 미로를 한 칸 이동하는 데는 1초가 걸린다.
로봇이 출발점에서 도착점까지 가장 빨리 이동할 경우 걸리는 시간을 구하는 프로그램을 작성하시오.
 
[ 입력 ]
첫 줄에 미로의 크기 X, Y(1≤X, Y≤100)가 주어진다.
둘째 줄에 출발점 x, y 좌표와 도착점 x, y 좌표가 공백으로 구분하여 주어진다.
셋째 줄부터 미로의 정보가 길은 0, 벽은 1로 공백이 없이 들어온다.
주의 사항으로, 좌표는 좌측상단이 가장 작은 위치이며 이 위치의 좌표는 (1,1)이다.
 
[ 출력 ]
첫 줄에 출발점에서 도착점까지 가장 빠른 시간을 출력한다.
 
[ 입력 예시 ]
8 7
1 2 7 5
11111111
00000111
10110011
10111001
10111101
10000001
11111111
 
[ 출력 예시 ]
9
	
 * @author ahnndroid
 *
 */
public class Main {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
